app/Controllers/Api/Visitor/AuthController.php

                'password'              => password_hash($body->password, PASSWORD_DEFAULT)
            ];

            $VisitorModel->insert($data);
---
INSERT INTO `visitors` (`state_id`, `visitor_type_id`, `visitor_person`, `first_name`, `last_name`, `company_name`, `mobile_number`, `wwcc`, `photo`, `form_data`, `email`, `is_covid_or_sickness`, `location_service`, `latitude`, `longitude`, `unique_key`, `password`, `created_at`, `updated_at`) VALUES ('1', '1', '0', 'Tapan', 'Malaviya', 'Tech', '7986543210', 'dw78w', '172741806966f64ed5bd0e0.png', '', 'tapan@gmail.com', '0', '0', '', '', 'FEoDZ7xMP4ZAaf5r', '$2y$10$F9vhuFOiBlAYEhTvC6JiSudZhv7HWC/8HlK.G9NFDTBlCsUAiqIoq', '2024-09-27 06:21:09', '2024-09-27 06:21:09')