app/Controllers/Api/Management/AdminController.php

UPDATE `management_staff` SET `password` = '$2y$10$s5jHmXuechir3VE9KI0teu8y4tbKcPSH9ipsCrgyPPB25jHkW6Re.'
WHERE `id` = '2'
---
    public function alertUpdate()
    {
        $rules = [
            'management_staff_id' => ['rules' => 'required'],
            'alert' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                $db = \Config\Database::connect();
                $management_staff = $db->table('management_staff');
                $managementStaff = $management_staff->where('id', $body->management_staff_id);
                $data = [
                    'alert' => $body->alert
                ];

                if($managementStaff->update($data)){