app/Controllers/Api/Management/AlertController.php

    public function alertData()
    {
        $rules = [
            'management_id' => ['rules' => 'required'],
            'management_type' => ['rules' => 'required']

        ];
        $body = json_decode($this->request->getBody());
        if ($this->validate($rules)) {
            try {
                helper('common');
                if($body->management_type == 'staff'){
                    $management_id = managementTypeToIdGet($body->management_id);
                }else{
                    $management_id = $body->management_id;
                }

                $managementAlert = new ManagementAlert();
                $managementAlert = $managementAlert->where('management_id', $management_id)->first();
---
SELECT *
FROM `management_alert`
WHERE `management_id` = '36'
 LIMIT 1

    public function updateAlertData()
    {
        $bodyData = json_decode($this->request->getBody());
        $db = \Config\Database::connect();
        try {
            $bodys = $bodyData->data;
            foreach($bodys as $body){
                $ManagementAlert = new ManagementAlert();
                $ManagementAlert = $ManagementAlert->where('id', $body->alert_id)->first();
                if (!is_null($ManagementAlert)) {
                    $managementAlertUpdate = $db->table('management_alert');
                    $managementAlertUpdate = $managementAlertUpdate->where('id', $body->alert_id);
                    $data = [
                        'set_alert_time'  => $body->set_alert_time,
                        'method'  => $body->method,
                        'visitor'  => $body->visitor,
                        'admin_staff'  => $body->admin_staff,
                        'whome_visiting'  => $body->whome_visiting,
                        'turn_alert'  => $body->turn_alert,
                    ];
                    $managementAlertUpdate->update($data);
---
SELECT *
FROM `management_alert`
WHERE `id` = '13'
 LIMIT 1
UPDATE `management_alert` SET `set_alert_time` = '', `method` = '0', `visitor` = '1', `admin_staff` = '0', `whome_visiting` = '1', `turn_alert` = '0'
WHERE `id` = '13'

    public function keyAlertData()
    {
        $rules = [
            'management_id' => ['rules' => 'required'],
            'management_type' => ['rules' => 'required']
        ];
        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('common');
                if($body->management_type == 'staff'){
                    $management_id = managementTypeToIdGet($body->management_id);
                }else{
                    $management_id = $body->management_id;
                }
                $managementAlert = new ManagementKeyAlert();
                $managementAlert = $managementAlert->where('management_id', $management_id)->first();
---
SELECT *
FROM `management_key_alert`
WHERE `management_id` = '29'
 LIMIT 1

    public function singleAlertData($management_id)
    {
        $managementAlert = new ManagementAlert();
        $managementAlerts = $managementAlert->where('management_id', $management_id)->where('status', 1)->get();
---
SELECT *
FROM `management_alert`
WHERE `management_id` = '29'
AND `status` = 1

    public function singleKeyAlertData($management_id)
    {
        $managementKeyAlert = new ManagementKeyAlert();
        $managementKeyAlerts = $managementKeyAlert->where('management_id', $management_id)->where('status', 1)->get();
---
SELECT *
FROM `management_key_alert`
WHERE `management_id` = '29'
AND `status` = 1