app/Controllers/Api/Management/AlertController.php

    public function singleAlertData($management_id)
    {
        $managementAlert = new ManagementAlert();
        $managementAlerts = $managementAlert->where('management_id', $management_id)->where('status', 1)->get();
---
SELECT *
FROM `management_alert`
WHERE `management_id` = '29'
AND `status` = 1