app/Controllers/Api/Management/AlertController.php

INSERT INTO `management_alert` (`management_id`, `created_at`, `updated_at`) VALUES ('36', '2024-08-20 05:22:24', '2024-08-20 05:22:24')
---
    public function alertData()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];
        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                $managementAlert = new ManagementAlert();
                $managementAlert = $managementAlert->where('management_id', $body->management_id)->first();
                if (is_null($managementAlert)) {

                    $management = new ManagementAlert();
                    $data = [
                        'management_id' => $body->management_id,
                    ];
                    $management->insert($data);