app/Controllers/Api/Management/AuthController.php

    public function login()
    {

        $rules = [
            'email' => ['rules' => 'required|valid_email'],
            'password' => ['rules' => 'required'],
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {

            $managementModel = new Management();
            $managementTypeModel = new ManagementType();
            $managementStaffModel = new ManagementStaff();

            $email = $body->email;
            $password = $body->password;

            $management = $managementModel->where('email', $email)->first();

            if (is_null($management)) {

                $managementStaff = $managementStaffModel->where('email', $email)->first();
---
SELECT *
FROM `management`
WHERE `email` = 'staff1@gmail.com'
 LIMIT 1
SELECT *
FROM `management_staff`
WHERE `email` = 'staff1@gmail.com'
 LIMIT 1

                    $name = explode(' ', $managementStaff['name']);
                    $first_name = $name[0];
                    $last_name = $name[1];
                    $managementData = $managementModel->where('id', $managementStaff['management_id'])->select(['title'])->first();
                    $title = $managementData['title'];
                    $mobile_number = $managementStaff['mobile_number'];
                    $type = 'staff';
                    $managementType = $managementTypeModel->where('type', $managementStaff['role'])->select(['id as management_type_id', 'type as management_type'])->first();
---
SELECT `title`
FROM `management`
WHERE `id` = '36'
 LIMIT 1
SELECT `id` as `management_type_id`, `type` as `management_type`
FROM `management_type`
WHERE `type` = 'Associate'
 LIMIT 1

                        'date'     => date('Y-m-d'),
                        'time_in' => date('H:i:s')
                    ];
                    $managementLoginModel->insert($data);
---
INSERT INTO `management_login` (`staff_id`, `date`, `time_in`, `created_at`, `updated_at`) VALUES ('1', '2024-08-27', '08:35:48', '2024-08-27 20:35:48', '2024-08-27 20:35:48')