app/Controllers/Api/Management/FormController.php

    public function list()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('text');
                $managementForm = new ManagementForm();
                $managementForm = $managementForm->where('management_id', $body->management_id)->get();
                $data = array(); $d=0;
                if ($results = $managementForm->getResult()) {
---
SELECT *
FROM `management_form`
WHERE `management_id` = '1'