app/Controllers/Api/Management/KeyController.php

    public function history()
    {
        $rules = [
            'management_key_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('text');

                $visitorRecordKeys = new VisitorRecordKeys();
                $visitorRecordKeys->select('visitor_record_keys.*, visitors.first_name, visitors.last_name, visitors.company_name, visitor_type.type')->join('visitor_records', 'visitor_records.id = visitor_record_keys.records_id')->join('visitors', 'visitors.id = visitor_records.visitor_id')->join('visitor_type', 'visitor_type.id = visitors.visitor_type_id');

                if(!empty($body->visitor_type_id)){
                    $visitorRecordKeys->where('visitor_type.id', $body->visitor_type_id);
                }
                if(!empty($body->name)){
                    $conditions = "(visitors.first_name LIKE '%" . $body->name . "%' OR visitors.last_name LIKE '%" . $body->name . "%')";
                    $visitorRecordKeys->where($conditions);
                }
                if(!empty($body->company_name)){
                    $visitorRecordKeys->where('visitors.company_name', $body->company_name);
                }

                $visitorRecordKeys->where('visitor_record_keys.management_key_id', $body->management_key_id);

                $visitorRecordKeysData = $visitorRecordKeys->orderBy('created_at','DESC')->get();
---
SELECT `visitor_record_keys`.*, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `visitor_record_keys`
JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE `visitor_type`.`id` = '7'
AND `visitor_record_keys`.`management_key_id` = '3'
ORDER BY `created_at` DESC
SELECT `management_key`.*, `visitor_record_keys`.`records_id`, `visitor_record_keys`.`loan_period`, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `management_key`
LEFT JOIN `visitor_record_keys` ON `visitor_record_keys`.`management_key_id` = `management_key`.`id`
LEFT JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
LEFT JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
LEFT JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE `management_key`.`management_id` = '36'
ORDER BY `management_key`.`created_at` DESC

                        if(!empty($body->serial_no)){
                            $managementKey = $managementKey->like('serial_no', '%'.$body->serial_no.'%')->where('id', $body->management_key_id)->first();
                        }else{
                            $managementKey = $managementKey->where('id', $body->management_key_id)->first();
---
SELECT *
FROM `management_key`
WHERE `id` = '3'
 LIMIT 1