app/Controllers/Api/Management/KeyController.php

SELECT *
FROM `management_key`
WHERE `id` = '4'
 LIMIT 1
---
    public function userList()
    {
        $rules = [
            'management_id' => ['rules' => 'required'],
            'management_type' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('text');
                helper('common');
                if($body->management_type == 'staff'){
                    $management_id = managementTypeToIdGet($body->management_id);
                }else{
                    $management_id = $body->management_id;
                }

                $managementKey = new ManagementKey();
                $managementKey = $managementKey->where('management_id', $management_id)->where('staff_id', '!=', '')->get();
                $data = array(); $d=0;
                if ($results = $managementKey->getResult()) {