app/Controllers/Api/Management/KeyController.php

SELECT *
FROM `management_key`
WHERE `management_id` = '36'
AND `key_id` = '1234'
---
    public function list()
    {
        $rules = [
            'management_id' => ['rules' => 'required'],
            'management_type' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('text');
                helper('common');

                // Filter for management_id based on management_type
                if($body->management_type == 'staff'){
                    $management_id = managementTypeToIdGet($body->management_id);
                } else {
                    $management_id = $body->management_id;
                }

                $managementKey = new ManagementKey();
                $managementKey = $managementKey->where('management_id', $management_id);

                // Add Filters if provided
                if (isset($body->key_id)) {
                    $managementKey = $managementKey->where('key_id', $body->key_id);

SELECT `visitor_record_keys`.*, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `visitor_record_keys`
JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE `visitor_record_keys`.`management_key_id` = '1'
AND `visitor_record_keys`.`status` = 0
 LIMIT 1
---

                        $visitorRecordKeys = new VisitorRecordKeys();

                        $visitorRecordKeysData = $visitorRecordKeys->select('visitor_record_keys.*, visitors.first_name, visitors.last_name, visitors.company_name, visitor_type.type')
                            ->join('visitor_records', 'visitor_records.id = visitor_record_keys.records_id')
                            ->join('visitors', 'visitors.id = visitor_records.visitor_id')
                            ->join('visitor_type', 'visitor_type.id = visitors.visitor_type_id')
                            ->where('visitor_record_keys.management_key_id', $result->id)
                            ->where('visitor_record_keys.status', 0);

SELECT `visitor_record_keys`.*, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `visitor_record_keys`
JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE (`visitors`.`first_name` LIKE '%je%' OR `visitors`.`last_name` LIKE '%je%')
AND `visitors`.`company_name` = 'Catover'
AND `visitor_record_keys`.`management_key_id` = '3'
ORDER BY `created_at` DESC
---
    public function history()
    {
        $rules = [
            'management_key_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                helper('text');

                $visitorRecordKeys = new VisitorRecordKeys();
                $visitorRecordKeys->select('visitor_record_keys.*, visitors.first_name, visitors.last_name, visitors.company_name, visitor_type.type')->join('visitor_records', 'visitor_records.id = visitor_record_keys.records_id')->join('visitors', 'visitors.id = visitor_records.visitor_id')->join('visitor_type', 'visitor_type.id = visitors.visitor_type_id');

                if(!empty($body->visitor_type_id)){
                    $visitorRecordKeys->where('visitor_type.id', $body->visitor_type_id);
                }
                if(!empty($body->name)){
                    $conditions = "(visitors.first_name LIKE '%" . $body->name . "%' OR visitors.last_name LIKE '%" . $body->name . "%')";
                    $visitorRecordKeys->where($conditions);
                }
                if(!empty($body->company_name)){
                    $visitorRecordKeys->where('visitors.company_name', $body->company_name);
                }

                $visitorRecordKeys->where('visitor_record_keys.management_key_id', $body->management_key_id);

                $visitorRecordKeysData = $visitorRecordKeys->orderBy('created_at','DESC')->get();

SELECT *
FROM `management_key`
WHERE `id` = '6'
 LIMIT 1
---
                        if(!empty($body->serial_no)){
                            $managementKey = $managementKey->like('serial_no', '%'.$body->serial_no.'%')->where('id', $body->management_key_id)->first();
                        }else{
                            $managementKey = $managementKey->where('id', $body->management_key_id)->first();