app/Controllers/Api/Management/ReportController.php

SELECT *
FROM `visitor_records`
WHERE `purpose_entry` = 'LOG-IN'
AND `management_id` = '29'
ORDER BY `created_at` DESC
SELECT *
FROM `visitors`
WHERE `id` = '125'
 LIMIT 1
SELECT *
FROM `visitor_type`
WHERE `id` = '3'
 LIMIT 1
---
    public function curerntVisitor()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $visitor_records_builder = $db->table('visitor_records');
            $visitor_records_builder->where('purpose_entry', 'LOG-IN');
            $visitor_records_builder->where('management_id', $body->management_id);
            $get_visitor = $visitor_records_builder->orderBy('created_at','DESC')->get();
            if ($results = $get_visitor->getResult()) {

                $data = array(); $d=0;
                foreach ($results as $key => $visitor_records) {

                    $visitor_builder = $db->table('visitors');
                    $visitor_builder->where('id', $visitor_records->visitor_id);
                    $visitor_builder->limit(1);
                    $visitor_builder = $visitor_builder->get();
                    $visitor = $visitor_builder->getFirstRow();

                    $visitor_type_builder = $db->table('visitor_type');
                    $visitor_type_builder->where('id', $visitor->visitor_type_id);
                    $visitor_type_builder->limit(1);
                    $visitor_type_builder = $visitor_type_builder->get();

SELECT *
FROM `visitor_records`
WHERE DATE(created_at) = '2024-09-03'
AND `management_id` = '29'
ORDER BY `created_at` DESC
---
    public function dailyData()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $visitor_records_builder = $db->table('visitor_records');
            $today = date('Y-m-d');
            $visitor_records_builder->where('DATE(created_at)', $today);
            $visitor_records_builder->where('management_id', $body->management_id);
            $get_visitor = $visitor_records_builder->orderBy('created_at','DESC')->get();

SELECT *
FROM `visitor_records`
WHERE `created_at` >= '2024-07-29'
AND `created_at` <= '2024-08-04'
AND `management_id` = '29'
ORDER BY `created_at` DESC
SELECT *
FROM `visitors`
WHERE `id` = '125'
 LIMIT 1
---
    public function weeklyData()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $visitor_records_builder = $db->table('visitor_records');
            $startDate = date('Y-m-d', strtotime('this week monday'));
            $endDate = date('Y-m-d', strtotime('this week sunday'));
            $visitor_records_builder->where('created_at >=', $startDate);
            $visitor_records_builder->where('created_at <=', $endDate);
            $visitor_records_builder->where('management_id', $body->management_id);
            $get_visitor = $visitor_records_builder->orderBy('created_at','DESC')->get();
            if ($results = $get_visitor->getResult()) {

                $data = array(); $d=0;
                foreach ($results as $key => $visitorRecords) {

                    $visitor_builder = $db->table('visitors');
                    $visitor_builder->where('id', $visitorRecords->visitor_id);
                    $visitor_builder->limit(1);
                    $visitor_builder = $visitor_builder->get();

SELECT *
FROM `visitor_type`
WHERE `id` = '3'
 LIMIT 1
---
                    $visitor_type = $db->table('visitor_type');
                    $visitor_type->where('id', $visitor->visitor_type_id);
                    $visitor_type->limit(1);
                    $visitor_type = $visitor_type->get();

SELECT *
FROM `management_key`
WHERE `management_id` = '36'
SELECT `visitor_record_keys`.*, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `visitor_record_keys`
JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE `visitor_record_keys`.`management_key_id` = '1'
AND `visitor_record_keys`.`status` = 0
 LIMIT 1
---
    public function keyOnLoan()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $managementKey = new ManagementKey();
            $managementKey = $managementKey->where('management_id', $body->management_id)->get();
            if ($results = $managementKey->getResult()) {
                $data = array(); $d=0;
                foreach ($results as $key => $result) {
                    $visitorRecordKeys = new VisitorRecordKeys();
                    $visitorRecordKeysData = $visitorRecordKeys->select('visitor_record_keys.*, visitors.first_name, visitors.last_name, visitors.company_name, visitor_type.type')->join('visitor_records', 'visitor_records.id = visitor_record_keys.records_id')->join('visitors', 'visitors.id = visitor_records.visitor_id')->join('visitor_type', 'visitor_type.id = visitors.visitor_type_id')->where('visitor_record_keys.management_key_id', $result->id)->where('visitor_record_keys.status', 0)->first();

SELECT *
FROM `management_key`
WHERE `management_id` = '36'
SELECT `visitor_record_keys`.*, `visitors`.`first_name`, `visitors`.`last_name`, `visitors`.`company_name`, `visitor_type`.`type`
FROM `visitor_record_keys`
JOIN `visitor_records` ON `visitor_records`.`id` = `visitor_record_keys`.`records_id`
JOIN `visitors` ON `visitors`.`id` = `visitor_records`.`visitor_id`
JOIN `visitor_type` ON `visitor_type`.`id` = `visitors`.`visitor_type_id`
WHERE `visitor_record_keys`.`management_key_id` = '1'
AND `visitor_record_keys`.`status` = 0
 LIMIT 1
---
    public function allKeyList()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $managementKey = new ManagementKey();
            $managementKey = $managementKey->where('management_id', $body->management_id)->get();
            if ($results = $managementKey->getResult()) {
                $data = array(); $d=0;
                foreach ($results as $key => $result) {
                    $data[$d]['key_id'] = $result->key_id;
                    $data[$d]['serial_no'] = $result->serial_no;
                    $data[$d]['key_type'] = $result->key_type;

                    $visitorRecordKeys = new VisitorRecordKeys();

                    $visitorRecordKeysData = $visitorRecordKeys->select('visitor_record_keys.*, visitors.first_name, visitors.last_name, visitors.company_name, visitor_type.type')->join('visitor_records', 'visitor_records.id = visitor_record_keys.records_id')->join('visitors', 'visitors.id = visitor_records.visitor_id')->join('visitor_type', 'visitor_type.id = visitors.visitor_type_id')->where('visitor_record_keys.management_key_id', $result->id)->where('visitor_record_keys.status', 0)->first();