app/Controllers/Api/Management/StaffReportController.php

SELECT `id`
FROM `management_staff`
WHERE `management_id` = '36'
GROUP BY `id`
SELECT CONCAT(WEEK(created_at, 1) - WEEK(DATE_SUB(created_at, INTERVAL DAY(created_at) - 1 DAY), 1) + 1, ' ', DATE_FORMAT(created_at, '%b %Y')) AS formatted_week
FROM `management_login`
WHERE `staff_id` IN ('1','2','5')
GROUP BY `formatted_week`
SELECT *
FROM `management_staff`
WHERE `management_id` = '36'
ORDER BY `name` ASC
---
    public function filterSelectList()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            $db = \Config\Database::connect();
            $managementBuilder = $db->table('management_staff');
            $managementBuilder->where('management_id', $body->management_id)
                            ->groupBy('id')
                            ->select('id');
            $staffIds = $managementBuilder->get()->getResultArray();
            if (!empty($staffIds)) {
                $week = array();

                $management_login_builder = $db->table('management_login');
                $management_login_builder->select("CONCAT(WEEK(created_at, 1) - WEEK(DATE_SUB(created_at, INTERVAL DAY(created_at) - 1 DAY), 1) + 1, ' ', DATE_FORMAT(created_at, '%b %Y')) AS formatted_week");
                $management_login_builder->whereIn('staff_id', array_column($staffIds, 'id'))->groupBy('formatted_week');
                $managementLogin = $management_login_builder->get();
                if ($results = $managementLogin->getResult()) {
                    foreach ($results as $result) {
                        $week[] = $result->formatted_week;
                    }
                }

                $managementStaff = new ManagementStaff();
                $managementStaff = $managementStaff->where('management_id', $body->management_id)->orderBy('name','ASC')->get();

SELECT `id`
FROM `management_staff`
WHERE `management_id` = '36'
GROUP BY `id`
---
    public function filterData()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $managementBuilder = $db->table('management_staff');
            $managementBuilder->where('management_id', $body->management_id)
                            ->groupBy('id')
                            ->select('id');

SELECT `id`
FROM `management_staff`
WHERE `management_id` = '36'
GROUP BY `id`
---
    public function currentWeekByName()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $managementBuilder = $db->table('management_staff');
            $managementBuilder->where('management_id', $body->management_id)
                            ->groupBy('id')
                            ->select('id');

SELECT `id`
FROM `management_staff`
WHERE `management_id` = '36'
GROUP BY `id`
---
    public function currentWeekByDate()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            helper('text');

            $db = \Config\Database::connect();
            $managementBuilder = $db->table('management_staff');
            $managementBuilder->where('management_id', $body->management_id)
                            ->groupBy('id')
                            ->select('id');