app/Controllers/Api/Management/StaffController.php

SELECT `id`
FROM `management_staff`
WHERE `management_id` = '36'
GROUP BY `id`
SELECT *
FROM `management_login`
WHERE `staff_id` IN ('1','2','5')
ORDER BY `created_at` DESC
SELECT CONCAT(WEEK(management_login.created_at, 1) - WEEK(DATE_SUB(management_login.created_at, INTERVAL DAY(management_login.created_at) - 1 DAY), 1) + 1, ' ', DATE_FORMAT(management_login.created_at, '%b %Y')) AS formatted_week
FROM `management_login`
WHERE `management_login`.`staff_id` = '1'
SELECT *
FROM `management_staff`
WHERE `id` = '1'
 LIMIT 1
---
    public function history()
    {
        $rules = [
            'management_id' => ['rules' => 'required']
        ];

        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            try {
                $db = \Config\Database::connect();
                $managementBuilder = $db->table('management_staff');
                $managementBuilder->where('management_id', $body->management_id)
                                ->groupBy('id')
                                ->select('id');
                $staffIds = $managementBuilder->get()->getResultArray();
                if (!empty($staffIds)) {
                    $managementLogin = new ManagementLogin();
                    $managementLogin = $managementLogin->whereIn('staff_id', array_column($staffIds, 'id'))->orderBy('created_at','DESC')->get();
                    $data = array(); $d=0;
                    if ($results = $managementLogin->getResult()) {
                        foreach ($results as $key => $result) {
                            $managementStaff = new ManagementStaff();
                            $staffData = $managementStaff->where('id', $result->staff_id)->first();