app/Controllers/Api/Management/VisitorController.php

    public function records()
    {
        $rules = [
            'management_id' => ['rules' => 'required'],
            'type' => ['rules' => 'required'],
            'page' => ['rules' => 'required']
        ];
        $body = json_decode($this->request->getBody());

        if ($this->validate($rules)) {
            $page = $body->page;
            $limit = 10;
            $start = $page * $limit - $limit;
            try {
                $db = \Config\Database::connect();

                $visitor_builder = $db->table('visitor_records');

                if($body->type == 'active'){
                    $visitor_builder->where('purpose_entry', 'LOG-IN');
                }else{
                    $visitor_builder->where('purpose_entry', 'LOG-IN-OUT');
                }
                $visitor_builder->where('management_id', $body->management_id);
                $visitor_builder->limit($limit, $start);
                $get_visitor = $visitor_builder->orderBy('created_at','DESC')->get();
---
SELECT *
FROM `visitor_records`
WHERE `purpose_entry` = 'LOG-IN'
AND `management_id` = '36'
ORDER BY `created_at` DESC
 LIMIT 10