app/Controllers/Api/Management/VisitorController.php

                        $visitor = $db->table('visitors');
                        $visitor->where('id', $result->visitor_id);
                        $visitor->limit(1);
                        $visitor = $visitor->get();
---
SELECT *
FROM `visitors`
WHERE `id` = '137'
 LIMIT 1

                        $visitor_type = $db->table('visitor_type');
                        $visitor_type->where('id', $visitorRecords->visitor_type_id);
                        $visitor_type->limit(1);
                        $visitor_type = $visitor_type->get();
---
SELECT *
FROM `visitor_type`
WHERE `id` = '1'
 LIMIT 1


                        $person_id = 0; $person_name = "others";
                        $person = $db->table('management_staff');
                        $person->where('id', $result->person_id);
---
SELECT *
FROM `management_staff`
WHERE `id` = '0'
 LIMIT 1

                        $data[$d]['mobile_number'] = $visitorRecords->mobile_number;

                        $visitorRecordKeys = new VisitorRecordKeys();
                        $visitorRecordKeysDatas = $visitorRecordKeys->where('records_id', $result->id)->where('status', 0)->get();
---
SELECT *
FROM `visitor_record_keys`
WHERE `records_id` = '3'
AND `status` = 0