app/Helpers/common_helper.php

function managementTypeToIdGet($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('management_staff');
    $record = $builder->getWhere(['id' => $id])->getRow();
---
SELECT *
FROM `management_staff`
WHERE `id` = '1'